Continued from previous comment.
<details><summary>Show Output</summary>

```diff
block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-east-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-east-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-east-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-east-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-west-3_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_eu-west-3_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_eu-west-3_us-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_sa-east-1_us-east-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_sa-east-1_us-east-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-east-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_sa-east-1_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_sa-east-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_sa-east-1_us-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_us-east-1_us-east-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-east-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-east-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-east-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-east-2.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-east-2.aws_route.peer[5] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-east-2.aws_route.peer[6] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-east-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-east-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_us-east-1_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-1.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-1.aws_route.peer[5] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-1.aws_route.peer[6] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_us-east-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-2.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-2.aws_route.peer[5] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-2.aws_route.peer[6] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-1_us-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_us-east-2_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-1.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-1"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_us-east-2_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-east-2_us-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_us-west-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-west-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-west-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.48.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_us-west-1_us-west-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "us-west-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

Plan: 1752 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on modules/aws_region/dhcp.tf line 2, in resource "aws_vpc_dhcp_options" "dhcp":
   2:   domain_name         = "${var.domain}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2009 more similar warnings elsewhere)


Warning: Quoted type constraints are deprecated

  on modules/peering-accepter/variables.tf line 4, in variable "route_tables":
   4:   type = "list"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "list" and write
list(string) instead to explicitly indicate that the list elements are
strings.

(and 209 more similar warnings elsewhere)


------------------------------------------------------------------------

This plan was saved to: tfplan.tmp

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.tmp"

mv -f -- "tfplan.tmp" "tfplan"
./scripts/softlimit distfiles/terraform-0.12.24 show -no-color -json "tfplan" | jq . > "tfplan.json.tmp"
mv -f -- "tfplan.json.tmp" "tfplan.json"
./scripts/softlimit distfiles/terraform-0.12.24 show -no-color -json < "terraform.tfstate" | jq . > "terraform.tfstate.json.tmp"
/bin/sh: terraform.tfstate: No such file or directory
mv -f -- "terraform.tfstate.json.tmp" "terraform.tfstate.json"
./scripts/softlimit distfiles/terraform-0.12.24 show -no-color -json < "terraform.tfstate.backup" | jq . > "terraform.tfstate.backup.json.tmp"
/bin/sh: terraform.tfstate.backup: No such file or directory
mv -f -- "terraform.tfstate.backup.json.tmp" "terraform.tfstate.backup.json"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://localhost:4141/lock?id=
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.